04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/venturiTube/system/graphs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      graphs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc graphCellFace
(
    name=graphA,
    start=(0 -0.051 0),
    end=(0 0.051 0),
    axis=y,
    U
)

#includeFunc graphCellFace
(
    name=graphB,
    start=(0.05 -0.051 0),
    end=(0.05 0.051 0),
    axis=y,
    U
)

#includeFunc graphCellFace
(
    name=graphC,
    start=(0.1625 -0.051 0),
    end=(0.1625 0.051 0),
    axis=y,
    U
)

#includeFunc graphCellFace
(
    name=graphD,
    start=(0.25 -0.051 0),
    end=(0.25 0.051 0),
    axis=y,
    U
)

#includeFunc graphCellFace
(
    name=graphE,
    start=(0.4 -0.051 0),
    end=(0.4 0.051 0),
    axis=y,
    U
)

#includeFunc graphCellFace
(
    name=graphF,
    start=(0.575 -0.051 0),
    end=(0.575 0.051 0),
    axis=y,
    U
)

// ************************************************************************* //
