04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/venturiTube/Allrun
#!/bin/sh

# Run from this directory
cd "${0%/*}" || exit 1

# Source tutorial run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

runApplication blockMesh
runApplication createZones
runApplication foamRun
./createGraphs

#------------------------------------------------------------------------------
